vks007/home_automation/ESPNowGateway_ESP8266/src/main.cpp
      for (var rowIndex = 1; rowIndex < rows.length; rowIndex++) {
        var deviceName = rows[rowIndex].cells[2].textContent.toLowerCase();
        rows[rowIndex].style.display = !activeDeviceFilter ||
          deviceName.indexOf(activeDeviceFilter) !== -1 ? '' : 'none';
      }
    }

    document.getElementById('device-filter-button').addEventListener('click', applyDeviceFilter);

    function formatClientTime() {
      return new Date().toLocaleTimeString([], {
        hour: 'numeric',
        minute: '2-digit',
        second: '2-digit',
        hour12: true
      });
    }

    document.querySelectorAll('[data-client-time]').forEach(function (cell) {
      cell.textContent = formatClientTime();
    });
  </script>
  </body></html>)rawliteral";

const char ws_script[] PROGMEM = R"rawliteral(
  <script>
    var ws = new WebSocket('ws://' + window.location.hostname + '/ws');
    ws.onmessage = function(event) {
      var table = document.querySelector('table');
      var row = table.insertRow(1); // Insert row at the top (after the header row)
      var data = JSON.parse(event.data);
      row.insertCell(0).textContent = formatClientTime();
      row.insertCell(1).textContent = data.message_id;
      row.insertCell(2).textContent = data.device_name;
      row.insertCell(3).textContent = data.msg_type;
      row.insertCell(4).textContent = data.sender_mac;
      row.insertCell(5).textContent = data.intvalue1;
      row.insertCell(6).textContent = data.intvalue2;
      row.insertCell(7).textContent = data.intvalue3;
      row.insertCell(8).textContent = data.intvalue4;
      row.insertCell(9).textContent = data.floatvalue1;
      row.insertCell(10).textContent = data.floatvalue2;
      row.insertCell(11).textContent = data.floatvalue3;
      row.insertCell(12).textContent = data.floatvalue4;
      row.insertCell(13).textContent = data.chardata1;
      row.insertCell(14).textContent = data.chardata2;
      applyDeviceFilter();
    };
  </script>)rawliteral";

#if defined(ESP32)
esp_now_peer_info_t peerInfo; // This object must be a global object else the setting of peer will fail
#endif
#if USING(SECURITY)
uint8_t kok[16]= PMK_KEY_STR;//comes from secrets.h
uint8_t key[16] = LMK_KEY_STR;// comes from secrets.h
#endif

espnow_message myData;
unsigned long start_time;
unsigned long last_msg_sent_time;
espnow_device esp_ota_device;
typedef struct gateway_stats
{
  unsigned long msg_count;
  unsigned long failed_msg_count;
  unsigned long cmnd_msg_count;
  float msg_rate;
  float free_mem_KB;// free memory in KB
  unsigned long uptime; // uptime in minutes
  int rssi;
  String str_mac;
  String str_macAP;
  short wifi_channel;
  short queue_length;
  String last_published_msg;
}gateway_stats;
gateway_stats gateway;

// ************ GLOBAL OBJECTS/VARIABLES *******************
#include "espnowController.h" //defines all utility functions for sending espnow messages from a controller


/*
 * connects to MQTT server , publishes LWT message as "online" every time it connects
 * waits for a time defined by MQTT_RETRY_INTERVAL before reconnecting again
 * I had issues with MQTT nto able to connect at times and so I included pinger to ping the gateway but then the issue hasnt happened for a long time now
 */
bool reconnectMQTT()
{
  if (!client.connected())
  {
    long now = millis();
    if ((now - lastReconnectAttempt > MQTT_RETRY_INTERVAL) || lastReconnectAttempt == 0) 
    {
      lastReconnectAttempt = now;
      DPRINTLN("Attempting MQTT connection...");
      // publishes the LWT message ("online") to the topic,If the this device disconnects from the broker ungracefully then the broker automatically posts the "offline" message on the LWT topic
      // so that all connected clients know that this device has gone offline
      char publish_topic[65] = ""; //variable accomodates 50 characters of main topic + 15 char of sub topic
      strcpy(publish_topic,MQTT_TOPIC);
      strcat(publish_topic,"/LWT"); 
      if (client.connect(DEVICE_NAME,mqtt_uname,mqtt_pswd,publish_topic,0,true,"offline")) {//credentials come from secrets.h
        DPRINTLN("MQTT connected");
        client.publish(publish_topic,"online",true);
        if(statusLED.getState() == LED_BLINKING)
          statusLED.cancel();
        return true;
      }
    }
    if(statusLED.getState() == LED_IDLE)
      statusLED.blink(1000, 500);
    return false;
  }
  if(statusLED.getState() == LED_BLINKING)
    statusLED.cancel();
  return true;
}

/*
 * Publishes a string message to MQTT , returns true if message was published successfully else false
 * IMPORTANT : Encountered a strange issue where the device was more than MAX_DEVICE_ID_LEN characters long, this caused the MQTT to return success for publish method but the message wasnt published
 * In the next step the MQTT conneciton was lost and it was re-established. So be careful of the length of the device name from the client side. Sample message below:  terrace_flow_meter is more than MAX_DEVICE_ID_LEN
 *  const char* json_msg = R"({"gateway":"gateway-ff","type":0,"mac":"62:01:94:FF:01:08","id":2,"device":"terrace_flow_meter","ival1":0,"ival2":0,"ival3":0,"ival4":0,"fval1":0,"fval2":0,"fval3":0,"fval4":0,"char1":"","char2":"1.0 Jan 11 2025"})";
 * This bug doesnt make sense as this finally is only a string in this method and the message was within MQTT_MAX_PACKET_SIZE (256). Didnt have time to debug this further so left it
 * The maximum length of a message that can be published on MQTT depends on the MQTT broker and the client library you are using. For the ESP8266 with the PubSubClient library, the default maximum message size is 256 bytes
 * #define MQTT_MAX_PACKET_SIZE 256 can be changed to #define MQTT_MAX_PACKET_SIZE 1024
 * Also be aware of : MAX_MSG_BUFFER_SIZE : This is the max size of the MQTT packet buffer, it includes topic name+payload+header bytes, set your payload max lenn accordingly using MAX_MESSAGE_LEN below
 * MAX_MESSAGE_LEN : defines max message length of payload message. Included space for 100 bytes for topic name + header
 */
bool publishToMQTT(const char msg[],const char topic[], bool retain)
{
  if(strlen(msg) > MQTT_MAX_PACKET_SIZE)
  {
    DPRINTFLN("publishToMQTT- Failed,Message too long:%u",strlen(msg));
    return false;
  }
  DPRINTFLN("msg:%s",msg);
  if(client.connected())
  {
    if(client.publish(topic,msg,retain))
    {
      DPRINTLN("publishToMQTT-Published.");
      if(mqtt_publish_fails>0)
        mqtt_publish_fails = 0;//reset the counter
      return true;
    }
    else
    {
      mqtt_publish_fails++;
      if(mqtt_publish_fails >= MAX_MQTT_PUBLISH_FAILURES)
      {
        DPRINTLN("publishToMQTT-Failed max allowed times. triggering ESP restart");
        MQTT_wd.update(false,true); // ask the watchdog to restart the ESP
      }
      else
      {
        // see if disconnecting the client will solve the issue
        client.disconnect();
        DPRINTLN("publishToMQTT-Failed, willfully disconnected MQTT.");
      }
    }
  }
  else
    DPRINTLN("Publish failed - MQTT not connected");
  return false;
}

