vks007/home_automation/ESPNowGateway_ESP8266/src/main.cpp
/*
 * Creates a json string from the espnow message and publishes it to a MQTT queue. Truncates the message if it exceeds MAX_MESSAGE_LEN
 * Returns true if message was published successfully else false
 */
bool publishToMQTT(espnow_message msg) {
  char final_publish_topic[65] = "";
  char publish_topic[65] = "";
  // create a path for this specific device which is of the form MQTT_BASE_TOPIC/<master_id> , master_id is usually the mac address stripped off the colon eg. MQTT_BASE_TOPIC/2CF43220842D
  strcpy(publish_topic,MQTT_BASE_TOPIC);
  strcat(publish_topic,"/");
  strcat(publish_topic,msg.device_name); // from here on all messages would be published within this topic specific for this device
  strcpy(final_publish_topic,publish_topic);
  if(msg.msg_type == ESPNOW_SENSOR)
    strcat(final_publish_topic,STATE_TOPIC);// create a topic to publish the state of the device
  else if(msg.msg_type == ESPNOW_OTA)
    strcat(final_publish_topic,OTA_TOPIC);// create a topic to publish the ota state of the device
  else // unknown message type , publish this on the error topic
    strcat(final_publish_topic,ERROR_TOPIC);// create a topic to publish error

//  DPRINTF("publishToMQTT:%lu,%d,%d,%d,%d,%f,%f,%f,%f,%s,%s\n",msg.message_id,msg.intvalue1,msg.intvalue2,msg.intvalue3,msg.intvalue4,msg.floatvalue1,msg.floatvalue2,msg.floatvalue3,msg.floatvalue4,msg.chardata1,msg.chardata2);
  
  JsonDocument msg_json;
  msg_json["gateway"] = WiFi.hostname();
  msg_json["type"] = msg.msg_type;
  msg_json["mac"] = msg.sender_mac;
  msg_json["id"] = msg.message_id;
  msg_json["device"] = msg.device_name;
  msg_json["ival1"] = msg.intvalue1;
  msg_json["ival2"] = msg.intvalue2;
  msg_json["ival3"] = msg.intvalue3;
  msg_json["ival4"] = msg.intvalue4;
  msg_json["fval1"] = msg.floatvalue1;
  msg_json["fval2"] = msg.floatvalue2;
  msg_json["fval3"] = msg.floatvalue3;
  msg_json["fval4"] = msg.floatvalue4;
  msg_json["char1"] = msg.chardata1;
  msg_json["char2"] = msg.chardata2;

  // Serialize the JSON document to a string
  String str_msg;
  serializeJson(msg_json, str_msg);

  // Check if the length exceeds MAX_MESSAGE_LEN
  if (str_msg.length() >= MAX_MESSAGE_LEN) {
    // Calculate the excess length
    int excess_length = str_msg.length() - MAX_MESSAGE_LEN;

    // Truncate the char2 field by the excess length if it is within the limit of 64 characters
    if (excess_length < 64) {
      msg.chardata2[strlen(msg.chardata2) - excess_length] = '\0'; // Truncate the char2 field
      excess_length = 0;
    }
    else {
      // Truncate the char2 entirely and add a null terminator
      msg.chardata2[0] = '\0';
      excess_length = excess_length - 64;
    }
    if (excess_length < 64) {
      msg.chardata1[strlen(msg.chardata2) - excess_length] = '\0'; // Truncate the char2 field
      excess_length = 0;
    }
    // not proceeding with further truncation as there is no possibility of the string exceeding further

    // Re-serialize the JSON document to a string
    msg_json["char2"] = msg.chardata2;
    str_msg = "";
    serializeJson(msg_json, str_msg);
  }

  DPRINTF("Going to publish message with len:%u\n", str_msg.length());
  return publishToMQTT(str_msg.c_str(), final_publish_topic, false);
}

#if USING(MOTION_SENSOR)
/*
 * Creates a message string for motion ON message and publishes it to a MQTT queue
 * Returns true if message was published successfully else false
 */
bool publishMotionMsgToMQTT(const char topic_name[],const char state[4]) {
  char publish_topic[65] = "";
  // create a path for this specific device which is of the form MQTT_BASE_TOPIC/<master_id> , master_id is usually the mac address stripped off the colon eg. MQTT_BASE_TOPIC/2CF43220842D
  strcpy(publish_topic,MQTT_TOPIC);
  strcat(publish_topic,"/");
  strcat(publish_topic,topic_name);
  strcat(publish_topic,"/state");
  return publishToMQTT(state,publish_topic,false);
}
#endif

/*
 * Callback when data is sent , It sets the bResultReady flag to true on successful delivery of message
 * The flag is set to false in the main loop where data is sent and then the code waits to see if it gets set to true, if not it retires to send
 */
esp_now_send_cb_t OnDataSent([](uint8_t *mac_addr, uint8_t status) {
  deliverySuccess = status;
  //DPRINT("OnDataSent:Last Packet delivery status:\t");
  //DPRINTLN(status == 0 ? "Success" : "Fail");
  bResultReady = true;
});

/*
 * Callback called on sending a message.
 */
void OnDataRecv(uint8_t * mac, uint8_t *incomingData, uint8_t len) {
  espnow_message msg;
  memcpy(&msg, incomingData, sizeof(msg));
  DPRINTF("OnDataRecv:%lu,%d,%d,%d,%d,%d,%f,%f,%f,%f,%s,%s\n",msg.message_id,msg.msg_type,msg.intvalue1,msg.intvalue2,msg.intvalue3,msg.intvalue4,msg.floatvalue1,msg.floatvalue2,msg.floatvalue3,msg.floatvalue4,msg.chardata1,msg.chardata2);
  structQueue.push(msg);
};

/*
 * updates the gateway statistics , called before publishing a health message
 */
void update_gateway_stats()
{
  gateway.queue_length = structQueue.size();
  gateway.rssi = WiFi.RSSI();
  gateway.str_mac = WiFi.macAddress();
  gateway.str_macAP = WiFi.softAPmacAddress();
  gateway.uptime = millis()/6000; //publish uptime in minutes
  gateway.wifi_channel = WiFi.channel();
  gateway.msg_rate = (gateway.msg_count - last_message_count)/(float)(HEALTH_INTERVAL/(60*1000));//rate calculated over one minute
  last_message_count = gateway.msg_count;//reset the count
  gateway.free_mem_KB = ESP.getFreeHeap()/ 1024.0;
}

/*
 * creates data for health message and publishes it
 * takes bool param init , if true then publishes the startup message else publishes the health check message
 */
bool publishHealthMessage(bool init=false)
{
  char publish_topic[65] = "";
  String str_msg="";
  update_gateway_stats();

  if(init)
  {
     // publish the init message
    JsonDocument init_msg_json;//It is recommended to create a new obj than reuse the earlier one by ArduinoJson
    init_msg_json["version"] = compile_version;
    init_msg_json["tot_memKB"] = (float)ESP.getFlashChipSize() / 1024.0;
    init_msg_json["mac"] = gateway.str_mac;
    init_msg_json["macAP"] = gateway.str_macAP;
    init_msg_json["wifiChannel"] = gateway.wifi_channel;
    strcpy(publish_topic,MQTT_TOPIC);
    strcat(publish_topic,"/init");
    str_msg="";
    serializeJson(init_msg_json,str_msg);
    return publishToMQTT(str_msg.c_str(),publish_topic,true);
  }
  else
  {
    JsonDocument msg_json;
    msg_json["uptime"] = gateway.uptime; // uptime in minutes
    msg_json["mem_freeKB"] = serialized(String((float)gateway.free_mem_KB,0));//Ref:https://arduinojson.org/v6/how-to/configure-the-serialization-of-floats/
    msg_json["msg_count"] = gateway.msg_count;
    msg_json["queue_len"] = gateway.queue_length;
    last_message_count = gateway.msg_count;//reset the count
    msg_json["msg_rate"] = serialized(String(gateway.msg_rate,1));//format with 1 decimal places, Ref:https://arduinojson.org/v6/how-to/configure-the-serialization-of-floats/

    // create a path for this specific device which is of the form MQTT_BASE_TOPIC/<master_id> , master_id is usually the mac address stripped off the colon eg. MQTT_BASE_TOPIC/2CF43220842D
    strcpy(publish_topic,MQTT_TOPIC);
    strcat(publish_topic,"/state");
    serializeJson(msg_json,str_msg);
    if(publishToMQTT(str_msg.c_str(),publish_topic,false))
    {
      // publish the wifi message , I am publishing this everytime because it also has rssi
      String strIP_address = WiFi.localIP().toString();
      JsonDocument wifi_msg_json;//It is recommended to create a new obj than reuse the earlier one by ArduinoJson
      wifi_msg_json["ip_address"] = strIP_address;
      wifi_msg_json["rssi"] = WiFi.RSSI();
      strcpy(publish_topic,MQTT_TOPIC);
      strcat(publish_topic,"/wifi");
      str_msg="";
      serializeJson(wifi_msg_json,str_msg);
      return publishToMQTT(str_msg.c_str(),publish_topic,true);
   }
  }
  return false;//control will never come here
}


void printInitInfo()
{
  DPRINTLN("Starting up as a ESPNow Gateway");
  #if USING(MOTION_SENSOR)
    DPRINTLN("Motion sensor ON");
  #else
    DPRINTLN("Motion sensor OFF");
  #endif
  #if USING(SECURITY)
    DPRINTLN("Security ON");
  #else
    DPRINTLN("Security OFF");
  #endif

