vks007/home_automation/ESPNowGateway_ESP8266/src/main.cpp
}

void notFound(AsyncWebServerRequest *request) {
  request->send(404, "text/plain", "URL Not found");
}

/*
 * Adds ESP MAC as a peer to which OTA messages need to be send and sets the relevant flags. The loop() then takes care of sending the messages to this device
 * param: peerAddress: address of the peer as an uint8 array
 * param: duration : duration in sec for which to keep sending this message
 * param: stop_on_delivery : flag to indicate it it should stop sending messages once it gets the delivery confirmation
 */
void prepare_for_OTA(uint8_t peerAddress[])
{
//  espnow_message myData;
  #if(USING(SECURITY))
    refreshPeer(peerAddress, key,RECEIVER_ROLE);
  #else
    refreshPeer(peerAddress, NULL,RECEIVER_ROLE);
  #endif
  // If devicename is not given then generate one from MAC address stripping off the colon
  #ifdef DEVICE_NAME
    strcpy(myData.device_name,DEVICE_NAME);
  #else
    String wifiMacString = WiFi.macAddress();
    wifiMacString.replace(":","");
    snprintf(myData.device_name, 16, "%s", wifiMacString.c_str());
  #endif
  myData.msg_type = ESPNOW_OTA;
  esp_ota_device.ota_mode = true; // set the ota flag which will trigger the OTA flow in loop()
  esp_ota_device.ota_done = false; // reset the success flag
  start_time = millis(); // start the timer
  //DPRINTLN("Device prepared for sending OTA messages:%02X:%02X:%02X:%02X:%02X:%02X ",peerAddress[0],peerAddress[1],peerAddress[2],peerAddress[3],peerAddress[4],peerAddress[5]);
  DPRINTLN("Device prepared for sending OTA messages");
}

// Function to handle the root URL
void handleRoot(AsyncWebServerRequest *request) {
  String html = index_html;
  html.replace("<!--SCRIPT-->", ws_script);
  html.replace("ESPNOW Gateway", DEVICE_NAME);
  html.replace("HEADING", DEVICE_NAME " - Processed Messages");
  request->send(200, "text/html", html);
}

// Function to generate the HTML table rows
String generate_pending_table_rows() {
  String rows = "";
  for (size_t i = 0; i < structQueue.size(); i++) {
    const auto& msg = structQueue[i];
    rows += "<tr>";
    rows += "<td data-client-time></td>";
    rows += "<td>" + String(msg.message_id) + "</td>";
    rows += "<td>" + String(msg.device_name) + "</td>";
    rows += "<td>" + String(msg.msg_type) + "</td>";
    rows += "<td>" + String(msg.sender_mac) + "</td>";
    rows += "<td>" + String(msg.intvalue1) + "</td>";
    rows += "<td>" + String(msg.intvalue2) + "</td>";
    rows += "<td>" + String(msg.intvalue3) + "</td>";
    rows += "<td>" + String(msg.intvalue4) + "</td>";
    rows += "<td>" + String(msg.floatvalue1) + "</td>";
    rows += "<td>" + String(msg.floatvalue2) + "</td>";
    rows += "<td>" + String(msg.floatvalue3) + "</td>";
    rows += "<td>" + String(msg.floatvalue4) + "</td>";
    rows += "<td>" + String(msg.chardata1) + "</td>";
    rows += "<td>" + String(msg.chardata2) + "</td>";
    rows += "</tr>";
  }
  return rows;
}

// Function to handle the root URL
void handle_queue(AsyncWebServerRequest *request) {
  String html = index_html;
  html.replace("ESPNOW Gateway", DEVICE_NAME);
  html.replace("HEADING", DEVICE_NAME " - Queued Messages");
  html.replace("<!--TABLEROWS-->", generate_pending_table_rows());
  request->send(200, "text/html", html);
}


void config_webserver()
{
  server.on("/", HTTP_GET, handleRoot);
  server.on("/queue", HTTP_GET, handle_queue);
  
  #if(USING(ESPNOW_OTA_SERVER))
  server.on("/ota", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send_P(200, "text/html", index_html_ota);
  });

  // Handles OTA request for an ESPNOW device
  server.on("/espnowota", HTTP_GET, [] (AsyncWebServerRequest *request) {
    String mac_addr , response_msg;
    // OTA can be triggered only for one device at a time, reject this request if one is already in progress
    if(!esp_ota_device.ota_mode)
    {
      if (request->hasParam(input_param_mac)) {
        mac_addr = request->getParam(input_param_mac)->value();
        if(validate_MAC(mac_addr.c_str()))
        {
          DPRINTFLN("MAC %s is valid",mac_addr.c_str());
          mac_addr.replace(MAC_DELIMITER,"");
          MAC_to_array(mac_addr.c_str(),esp_ota_device.mac,6);
          // now extract the other params
          String str_temp;
          if (request->hasParam("input_duration")) {
            str_temp = request->getParam("input_duration")->value();
            if(isNumeric(str_temp))
              esp_ota_device.duration = (short)str_temp.toInt();
            else
              esp_ota_device.duration = OTA_TRIGGER_DURATION;
          }
          if (request->hasParam("input_interval")) {
            str_temp = request->getParam("input_interval")->value();
            if(isNumeric(str_temp))
              esp_ota_device.interval = (short)str_temp.toInt();
            else
              esp_ota_device.interval = OTA_MSG_INTERVAL;
          }
          prepare_for_OTA(esp_ota_device.mac);
          response_msg = "ESPNOW OTA req sent to device: ";
        }
        else
        {
          response_msg = "MAC address provided in invalid : ";
          DPRINTFLN("MAC %s is invalid",mac_addr.c_str());
        }
      }
      else 
      {
        mac_addr = "none";
      }
    }
    else
    {
      char buffer[18];
      sprintf(buffer, "%02X:%02X:%02X:%02X:%02X:%02X",esp_ota_device.mac[0],esp_ota_device.mac[1],esp_ota_device.mac[2],esp_ota_device.mac[3],esp_ota_device.mac[4],esp_ota_device.mac[5] );
      response_msg = "OTA already in progress for device: " + String(buffer);
      DPRINTLN(response_msg);
    }
    request->send(200, "text/html", response_msg + mac_addr + " <br><a href=\"/\">Return to Home Page</a>");
  });
  #endif
  server.onNotFound(notFound);
  server.addHandler(&ws); // for websocket
  server.begin();  
}


/*
 * Initializes the ESP with espnow and WiFi client , OTA etc
 */
void setup() {
  // Initialize Serial Monitor , if we're usng pin 3 on ESP8266 for PIR then initialize Serial as Tx only , disable Rx
  // ATTENTION : this is not working as inteded as PIR still holds Rx as LOW while startup and so the ESP doesnt boot
  // As a temp solution , dont turn ON Serial if you're using Rx as PIR PIN
  #if USING(MOTION_SENSOR)
  if(PIR_PIN == 3)
    {DBEGIN(115200, SERIAL_8N1, SERIAL_TX_ONLY);}
  else
    {DBEGIN(115200);}
  #else
    {DBEGIN(115200);}
  #endif

  DPRINTFLN("Value of MQTT_MAX_PACKET_SIZE is %u",MQTT_MAX_PACKET_SIZE);
  printInitInfo();

  // Set the device as a Station and Soft Access Point simultaneously
  // This has to be WIFI_AP_STA and not WIFI_STA, if set to WIFI_STA then it can only receive broadcast messages and stops receiving MAC specific messages.
  // The main problem seems to be caused by the station mode WiFi going into sleep mode while you have no work. This means that it does not listen to receive ESP-Now packets
  // and therefore they are lost. To solve this we will have to force our microcontroller to listen continuously, and this is achieved by turning it into an AP (Access Point)
  WiFi.mode(WIFI_AP_STA); 

  // Set a custom MAC address for the device. This is helpful in cases where you want to replace the actual ESP device in future
  // A custom MAC address will allow all sensors to continue working with the new device and you will not be required to update code on all devices
  uint8_t customMACAddress[] = DEVICE_MAC; // defined in Config.h
  setCustomMAC(customMACAddress,false);

  pinMode(STATUS_LED,OUTPUT);
  WiFi.config(ESP_IP_ADDRESS, default_gateway, subnet_mask);//from secrets.h
  String device_name = DEVICE_NAME;
  device_name.replace("_","");//hostname dont allow underscores or spaces
  device_name.replace(" ","-");//hostname dont allow underscores or spaces
  char hostname[24];
  strncpy(hostname, device_name.c_str(), 23); //hostname can be a max of 24 chars only
  hostname[23] = '\0'; // Ensure null termination
  WiFi.hostname(hostname); // Set Hostname.  

  // Connect to the WiFi as a station device
  WiFi.begin(ssid, password);
  DPRINTLN("Setting as a Wi-Fi Station..");
  while (WiFi.status() != WL_CONNECTED) {
    delay(500);
    DPRINT(".");
  }
  DPRINT("Station IP Address: ");
  DPRINTLN(WiFi.localIP());
  DPRINT("Wi-Fi Channel: ");
  DPRINTLN(WiFi.channel());
  WiFi.setAutoReconnect(true);
  
