vks007/home_automation/ESPNowGateway_ESP8266/src/main.cpp
  //mdns is necessary to broadcast the hostname.local address
  if(MDNS.begin(WiFi.getHostname(),WiFi.localIP()))
    {DPRINT("MDNS set up successfully with hostname: ");DPRINTLN(WiFi.getHostname());
    }
  else
    DPRINTLN("error setting up MDNS");

  if((WiFi.status() == WL_CONNECTED))
  {
    client.setServer(mqtt_broker, mqtt_port);// from secrets.h
  }
  // Init ESP-NOW
  if (esp_now_init() != ESP_OK) {
    DPRINTLN("Error initializing ESP-NOW");
    return;
  }
  
  esp_now_set_self_role(MY_ROLE);
  #if USING(SECURITY)
  // Setting the PMK key
  esp_now_set_kok(kok, KEY_LEN);
  byte channel = wifi_get_channel();
  // Add each controller who is expected to send a message to this gateway
  for(byte i = 0;i< sizeof(controller_mac)/6;i++)
  {
    esp_now_add_peer(controller_mac[i], RECEIVER_ROLE, channel, key, KEY_LEN);
    DPRINTFLN("Added controller :%02X:%02X:%02X:%02X:%02X:%02X",controller_mac[i][0],controller_mac[i][1],controller_mac[i][2],controller_mac[i][3],controller_mac[i][4],controller_mac[i][5] );
  }
   #endif

  esp_now_register_send_cb(OnDataSent);
  esp_now_register_recv_cb(OnDataRecv);
  DPRINT("WiFi address:");DPRINTLN(WiFi.macAddress());
  DPRINT("SoftAP address:");DPRINTLN(WiFi.softAPmacAddress());

  ArduinoOTA.onStart([]() {
    String type;
    if (ArduinoOTA.getCommand() == U_FLASH) {
      type = "sketch";
    } else { // U_FS
      type = "filesystem";
    }

    // NOTE: if updating FS this would be the place to unmount FS using FS.end()
    DPRINTLN("Start updating " + type);
  });
  ArduinoOTA.onEnd([]() {
    DPRINTLN("\nEnd");
  });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    DPRINTF("Progress: %u%%\r", (progress / (total / 100)));
  });
  ArduinoOTA.onError([](ota_error_t error) {
    DPRINTF("Error[%u]: ", error);
    if (error == OTA_AUTH_ERROR) {
      DPRINTLN("Auth Failed");
    } else if (error == OTA_BEGIN_ERROR) {
      DPRINTLN("Begin Failed");
    } else if (error == OTA_CONNECT_ERROR) {
      DPRINTLN("Connect Failed");
    } else if (error == OTA_RECEIVE_ERROR) {
      DPRINTLN("Receive Failed");
    } else if (error == OTA_END_ERROR) {
      DPRINTLN("End Failed");
    }
  });
  ArduinoOTA.begin();
  config_webserver();
  //set MQTT buffer size
  if(client.getBufferSize() < MAX_MSG_BUFFER_SIZE)
  {
    if(!client.setBufferSize(MAX_MSG_BUFFER_SIZE))
      {DPRINTFLN("Failed to set MQTT buffer size to %d. Any messages over %d will fail to publish",MAX_MSG_BUFFER_SIZE,MQTT_MAX_PACKET_SIZE);}
    else
      {DPRINTFLN("Set MQTT buffer size to %d",MAX_MSG_BUFFER_SIZE);}
  }
  
  reconnectMQTT(); //connect to MQTT before publishing the startup message
  if(publishHealthMessage(true)) //publish the startup message
    initilized = true;
  #if USING(MOTION_SENSOR)
  if(!motion_sensor.begin(MOTION_SENSOR_NAME)) //initialize the motion sensor
    DPRINTLN("Failed to initialize motion sensor");
  #endif
  
  ha_api.setHAServer(ha_url, ha_port);
  ha_api.setHAPassword(ha_token);

}

/*
 * processes the command type messages which are calls to Home Assistant APIs with actions
 * at present always returns true, which means does not retry if failed.
 */
bool process_command_message(espnow_message &msg)
{
  if(msg.msg_type != ESPNOW_COMMAND)
    return false;
  char msg_data[sizeof(msg.chardata1)*2] = "";
  strcpy(msg_data,msg.chardata1);
  DPRINTLN(msg_data);
  strcat(msg_data,msg.chardata2);
  DPRINTLN(msg_data);
  char delim[] = "|";
  char *ptr = strtok(msg_data, delim);
  String domain = String(ptr);
  ptr = strtok(NULL, delim);
  String action = String(ptr);
  ptr = strtok(NULL, delim);
  String data = String(ptr);

  String serviceURL = "/api/services/";
  serviceURL = serviceURL + domain + "/" + action;
  DPRINTLN(serviceURL);
  DPRINTLN(data);
  ha_api.sendPostHA(serviceURL,data);
  return true;
}


#if USING(MOTION_SENSOR)
/*
 * determines the state of motion sensor and publishes a message accordingly
 */
void update_motion_sensor()
{
  short motion_state = motion_sensor.update();
  if(motion_state == 1)
  {
    DPRINTLN("Motion detected as ON");
    publishMotionMsgToMQTT(motion_sensor.getSensorName(),"on");
  }
  else if(motion_state == 2)
  {
    DPRINTLN("Motion detected as OFF");
    publishMotionMsgToMQTT(motion_sensor.getSensorName(),"off");
  }
}
#endif

void do_ota_server()
{
  #if(USING(ESPNOW_OTA_SERVER))
    if(esp_ota_device.ota_mode && !esp_ota_device.ota_done)
    {
      if(millis() < (start_time + esp_ota_device.duration*1000))
      {
        if((millis() - last_msg_sent_time) > esp_ota_device.interval)
        {
          myData.message_id = millis();
          bool result = sendESPnowMessage(&myData,esp_ota_device.mac,0,false);
          last_msg_sent_time = millis();
          //yield();// trying this out to see if the MQTT disconect bug gets solved
          if(result)
          {
            //DPRINTFLN("%lu: sent OTA message",myData.message_id);
          }
          else
          {
            DPRINTFLN("%lu: OTA message sending failed",myData.message_id);}
        }
      }
      else
      {
        esp_ota_device.ota_mode = false;
        esp_ota_device.ota_done = true;
        delete_peer(esp_ota_device.mac);// now that we're done with OTA , delete the peer
        DPRINTLN("OTA timed out without acknowlegdment from device");
      }
    }
  #endif

}

void do_health_check()
{
  // try to publish health message irrespective of the state of espnow messages
  if(millis() - last_time > HEALTH_INTERVAL)
  {
    if(initilized)
    {
      //publish the health message
      publishHealthMessage();
    }
    else
    // It might be possible when the ESP comes up MQTT is down, in that case an init message will not get published in setup()
    // The statement below will check and publish the same , only once
    {
      if(publishHealthMessage(true))
        initilized = true;
    }
    last_time = millis(); // This is reset irrespective of a successful publish else the main loop will continously try to publish this message
  }
}

void do_queue_check()
{
  if(structQueue.isFull())
  {
    DPRINTLN("Queue Full, restarting ESP to see if the issue goes away, messages will be lost");
    MQTT_wd.update(false,true); // ask the watchdog to restart the ESP
  }
}

void add_message_to_processed_queue(espnow_message msg)
{
  processedMessages.push(msg);
 // Notify WebSocket clients about the new message
  JsonDocument doc;
  doc["message_id"] = msg.message_id;
  doc["device_name"] = msg.device_name;
  doc["msg_type"] = msg.msg_type;
  doc["sender_mac"] = msg.sender_mac;
  doc["intvalue1"] = msg.intvalue1;
  doc["intvalue2"] = msg.intvalue2;
  doc["intvalue3"] = msg.intvalue3;
  doc["intvalue4"] = msg.intvalue4;
  doc["floatvalue1"] = msg.floatvalue1;
  doc["floatvalue2"] = msg.floatvalue2;
  doc["floatvalue3"] = msg.floatvalue3;
  doc["floatvalue4"] = msg.floatvalue4;
  doc["chardata1"] = msg.chardata1;
  doc["chardata2"] = msg.chardata2;
  String json;
  serializeJson(doc, json);
  ws.textAll(json);
}

void process_message()
{
  static bool retry_message = false; // flag to indicate to retry sending of message in case of failure

