vks007/home_automation/ESPNowGateway_ESP8266/src/main.cpp
  if(!structQueue.isEmpty())
    if(!retry_message)
      currentMessage = structQueue.pop();
    //else last message content is still there is currentMessage
  
  if(currentMessage != emptyMessage)
  {
    DPRINTFLN("Processing msg:%lu,%d",currentMessage.message_id,currentMessage.msg_type);
    if(currentMessage.msg_type == ESPNOW_SENSOR)
    {
      if(publishToMQTT(currentMessage))
      {
        gateway.msg_count++;
        add_message_to_processed_queue(currentMessage);
        currentMessage = emptyMessage;
        retry_message = false;
      }
      else
      {
        retry_message = true;
      }//else the same message will be retried the next time
    }
    else if(currentMessage.msg_type == ESPNOW_COMMAND)
    {
      if(process_command_message(currentMessage))
      {
        gateway.msg_count++;
        gateway.cmnd_msg_count++;
        currentMessage = emptyMessage;
        retry_message = false;
      }
      else
      {
        retry_message = true;
      }//else the same message will be retried the next time
    }
    #if(USING(ESPNOW_OTA_SERVER))
    else if(currentMessage.msg_type == ESPNOW_OTA)
    {
      if(esp_ota_device.ota_mode)
      {
        char buffer[18];
        sprintf(buffer, "%02X:%02X:%02X:%02X:%02X:%02X",esp_ota_device.mac[0],esp_ota_device.mac[1],esp_ota_device.mac[2],esp_ota_device.mac[3],esp_ota_device.mac[4],esp_ota_device.mac[5] );
        if(xstrcmp(buffer,currentMessage.sender_mac))
        {
          esp_ota_device.ota_mode = false;
          esp_ota_device.ota_done = true;
          delete_peer(esp_ota_device.mac);// now that we're done with OTA , delete the peer
          DPRINTLN("OTA successfuly completed for device:");
        }
        else
          {DPRINTFLN("MAC address of OTA device did not match. Target mac: %s , MAC in msg: %s",buffer,currentMessage.sender_mac);}
      }
      else
        DPRINTLN("OTA ack message received when not in OTA mode, ignoring...");
      // pubish the OTA message to MQTT
      publishToMQTT(currentMessage);
      gateway.msg_count++;
      currentMessage = emptyMessage;
    }
    #endif
    else
    {
      DPRINTLN("message received without msg_type set, ignoring...");
      gateway.msg_count++;
      currentMessage = emptyMessage;
    }
  }

}

/*
 * This is the main loop where the code waits for the delivery of the message sent
 * If the message is not delivered within the timeout then it retries to send the message
 * The message is sent only once and the code waits for the delivery confirmation
 */
void loop() {
  //check for MQTT connection
  if (!client.connected()) 
  {
    reconnectMQTT(); // Attempt to reconnect
  } else {
    client.loop(); // Client connected
  }
  MQTT_wd.update(client.connected()); //feed the watchdog by calling update
  
  #if USING(MOTION_SENSOR)
    update_motion_sensor();
  #endif

  ArduinoOTA.handle();
  if(client.connected())
  {
    process_message();
  }
  do_health_check();
  //do_queue_check(); // commenting for now as I have to debug other issues, should uncomment it later
  statusLED.loop();
  do_ota_server();
  MDNS.update(); // Let MDNS advertise the hostname

}
